#### HVACLoadLoadsReportType Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing possible types of reports generated for HVAC loads.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum HVACLoadLoadsReportType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration HVACLoadLoadsReportType ``` |

| Visual C++ |
| --- |
| ``` public enum class HVACLoadLoadsReportType ``` |

# Members

| Member name | Description |
| --- | --- |
| NoReport | No report |
| SimpleReport | A simple report with summaries |
| StandardReport | A standard report including zones and spaces |
| DetailedReport | A detailed report including orientation breakdowns |

# See Also

Autodesk.Revit.DB.Analysis Namespace